app/controllers/api/v1/products_controller.rb

			def create
				@product = Product.new(product_params)
				if @product.save
---
INSERT INTO "products" ("name", "cost_price", "sku", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "banananas"], ["cost_price", 1.9], ["sku", "ABC1234567"], ["created_at", "2020-09-06 18:23:00.933974"], ["updated_at", "2020-09-06 18:23:00.933974"]]

      def update
        @product.update_attributes(product_params)
---
UPDATE "products" SET "cost_price" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["cost_price", 2.9], ["updated_at", "2020-09-01 14:46:50.809929"], ["id", 1]]