app/controllers/api/v1/stock_items_controller.rb

SELECT "stock_items".* FROM "stock_items"
---
      def index
				@stock_items = StockItem.all

INSERT INTO "stock_items" ("store_id", "product_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["store_id", 1], ["product_id", 1], ["amount", 3], ["created_at", "2020-09-01 19:52:37.768277"], ["updated_at", "2020-09-01 19:52:37.768277"]]
---
      def create
        @stock_item = StockItem.new(stock_items_params)

        if @stock_item.save